DataProcessors/ИнтеграцияКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияКабинетСотрудника</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПриложенияПоИмени</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПриложенияПоИмениДоступен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеПодключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеВЛокальнойСети</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИАдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКИМобильныйТелефон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоАвтономноеРабочееМесто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделениеВключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешенныеСимволыИмениДомена</Name>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяДомена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПояснениеИмяДомена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АбонентИПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАбонентаИПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресСервисаАвторизации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдминистраторНеУстановлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегламентныеЗаданияЗаблокированы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресРесурсовAPI</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/ВыгружаемыеОбъектыКабинетСотрудника.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ВыгружаемыеОбъектыКабинетСотрудника</Name>
			<Comment>Объекты, соответствующие правилам выгрузки</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловноВыгружается</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОкончаниеВыгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВыгружаетсяПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СсылкаПубликацииКабинетСотрудника</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/УведомлениеОНачалеОтпуска.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>УведомлениеОНачалеОтпуска</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьРуководителя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеПодписиРуководителя</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОснованиеПодписи</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Отпуска</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОтпуска</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОтпусков</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ИнтеграцияКабинетСотрудника/Forms/УведомленияОНачалеОтпуска/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НачалоПериода = Параметры.НачалоПериода;
	ОкончаниеПериода = Параметры.ОкончаниеПериода;
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Тогда 
		НачалоПериода = ДобавитьМесяц(НачалоМесяца(ТекущаяДатаСеанса()), 1);
		ОкончаниеПериода = КонецМесяца(НачалоПериода);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	Подразделение = Неопределено;
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗапланированныеОтпуска

&НаКлиенте
Процедура ЗапланированныеОтпускаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элемент.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	
	Если Поле.Имя = "ЗапланированныеОтпускаУведомление" Тогда 
		Если ЗначениеЗаполнено(ТекущиеДанные.Уведомление) Тогда 
			ПоказатьЗначение(, ТекущиеДанные.Уведомление);
		КонецЕсли;
	ИначеЕсли Поле.Имя = "ЗапланированныеОтпускаДокументЭДО" Тогда 
		Если ЗначениеЗаполнено(ТекущиеДанные.ДокументЭДО) Тогда 
			ПоказатьЗначение(, ТекущиеДанные.ДокументЭДО);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(ТекущиеДанные.ДокументПланирования) Тогда 
		ПоказатьЗначение(, ТекущиеДанные.ДокументПланирования);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапланированныеОтпускаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ЗапланированныеОтпускаОбработкаВыбораНаСервере(ВыбранноеЗначение);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(ОкончаниеПериода) Тогда 
		ИмяПоля = ?(ЗначениеЗаполнено(НачалоПериода), "ОкончаниеПериода", "НачалоПериода");
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен период'"), , ИмяПоля);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗапланированныеОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(НачалоПериода) Или Не ЗначениеЗаполнено(ОкончаниеПериода) Тогда 
		ИмяПоля = ?(ЗначениеЗаполнено(НачалоПериода), "ОкончаниеПериода", "НачалоПериода");
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не заполнен период'"), , ИмяПоля);
		Возврат;
	КонецЕсли;
	
	КадровыйУчетКлиент.ВыбратьСотрудниковРаботающихНаДатуПоПараметрамОткрытияФормыСписка(
		Элементы.ЗапланированныеОтпуска, 
		Организация,
		Подразделение,
		НачалоПериода,
		,
		АдресСпискаПодобранныхСотрудников());
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУведомления(Команда)
	
	ДлительнаяОперация = СформироватьУведомленияДлительнаяОперация();
	Если ДлительнаяОперация = Неопределено Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Отсутствуют строки с несформированными уведомлениями.'"));
		Возврат;
	КонецЕсли;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("СформироватьУведомленияЗавершение", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВсеСотрудники(Команда)
	
	МассивОбъектов = СписокУведомленийДляПечати();
	Если МассивОбъектов.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не сформированы уведомления.'"));
		Возврат;
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УведомлениеОНачалеОтпуска", "ПФ_MXL_УведомлениеОНачалеОтпуска", МассивОбъектов, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьВыбранныеСотрудники(Команда)
	
	ВыделенныеСтроки = Элементы.ЗапланированныеОтпуска.ВыделенныеСтроки;
	Если ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	МассивОбъектов = Новый Массив;
	Для Каждого ИдентификаторСтроки Из ВыделенныеСтроки Цикл
		Уведомление = ЗапланированныеОтпуска.НайтиПоИдентификатору(ИдентификаторСтроки).Уведомление;
		Если ЗначениеЗаполнено(Уведомление) Тогда 
			МассивОбъектов.Добавить(Уведомление);
		КонецЕсли;
	КонецЦикла;
	
	Если МассивОбъектов.Количество() = 0 Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Не сформированы уведомления по выбранным строкам.'"));
		Возврат;
	КонецЕсли;
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.УведомлениеОНачалеОтпуска", "ПФ_MXL_УведомлениеОНачалеОтпуска", МассивОбъектов, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьЗапланированныеОтпуска(ВыбранныеСотрудники = Неопределено)
	
	Если ВыбранныеСотрудники = Неопределено Тогда 
		ЗапланированныеОтпуска.Очистить();
	КонецЕсли;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Если ЗначениеЗаполнено(ВыбранныеСотрудники) Тогда
		КадровыйУчет.СоздатьНаДатуВТКадровыеДанныеСотрудников(МенеджерВременныхТаблиц, Истина, ВыбранныеСотрудники, "Организация", НачалоПериода, , , "ВТСотрудникиОрганизации");
	Иначе 
		
		ПараметрыПолученияСотрудников = КадровыйУчет.ПараметрыПолученияСотрудниковОрганизацийПоСпискуФизическихЛиц();
		ПараметрыПолученияСотрудников.Организация = Организация;
		ПараметрыПолученияСотрудников.НачалоПериода = НачалоПериода; 
		ПараметрыПолученияСотрудников.ОкончаниеПериода = ОкончаниеПериода; 
		ПараметрыПолученияСотрудников.КадровыеДанные = "Организация";
		
		Если ЗначениеЗаполнено(Подразделение) Тогда 
			ЗарплатаКадрыОбщиеНаборыДанных.ДобавитьВКоллекциюОтбор(ПараметрыПолученияСотрудников.Отборы, "Подразделение", "=", Подразделение);
		КонецЕсли;
		
		КадровыйУчет.ДополнитьИменаКадровыхДанных(ПараметрыПолученияСотрудников.КадровыеДанные);
		
		КадровыйУчет.СоздатьВТСотрудникиОрганизации(МенеджерВременныхТаблиц, Истина, ПараметрыПолученияСотрудников);
		
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	СотрудникиОрганизации.Организация КАК Организация,
		|	СотрудникиОрганизации.Сотрудник КАК Сотрудник
		|ПОМЕСТИТЬ ВТСотрудникиОтбор
		|ИЗ
		|	ВТСотрудникиОрганизации КАК СотрудникиОрганизации
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ПубликуемыеОбъекты
		|		ПО СотрудникиОрганизации.Сотрудник = ПубликуемыеОбъекты.Ссылка
		|			И (НЕ ПубликуемыеОбъекты.УсловноВыгружается)
		|			И (НЕ ПубликуемыеОбъекты.ВыгружаетсяПоСсылке)";
	
	Запрос.Выполнить();
	
	ДобавленныеСотрудники = Новый Соответствие;
	
	ОсновнойОтпуск = ОбщегоНазначения.ПредопределенныйЭлемент("Справочник.ВидыОтпусков.Основной");
	ДанныеУведомлений = ОстаткиОтпусков.ДанныеУведомленийОНачалеОтпуска(МенеджерВременныхТаблиц, НачалоПериода, ОкончаниеПериода, ИсключитьОформленныеОтпуска);
	
	Для Каждого ДанныеУведомления Из ДанныеУведомлений Цикл 
		
		ДобавленныеСотрудники.Вставить(ДанныеУведомления.Сотрудник, Истина);
		
		НоваяСтрока = ЗапланированныеОтпуска.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ДанныеУведомления);
		НоваяСтрока.ПериодыОтпуска = Новый ФиксированныйМассив(ДанныеУведомления.Периоды); 
		
		ПредставлениеОсновногоОтпуска = "";
		ПредставлениеДополнительныхОтпусков = "";
		
		Для Каждого СтрокаОтпуска Из ДанныеУведомления.Периоды Цикл 
			Если СтрокаОтпуска.ВидОтпуска = ОсновнойОтпуск Тогда 
				Если ЗначениеЗаполнено(СтрокаОтпуска.КоличествоДней) Тогда 
					ПредставлениеОсновногоОтпуска = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Основной (%1)'"), СтрокаОтпуска.КоличествоДней);
				КонецЕсли;
			Иначе 
				Если ЗначениеЗаполнено(СтрокаОтпуска.КоличествоДней) Тогда
					ПредставлениеВидаОтпуска = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 (%2)'"), Строка(СтрокаОтпуска.ВидОтпуска), СтрокаОтпуска.КоличествоДней);
					ПредставлениеДополнительныхОтпусков = ПредставлениеДополнительныхОтпусков 
					+ ?(ПредставлениеДополнительныхОтпусков = "", "", ", ") + ПредставлениеВидаОтпуска;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		ПредставлениеОтпуска = ПредставлениеОсновногоОтпуска;
		Если ПредставлениеДополнительныхОтпусков <> "" Тогда 
			ПредставлениеОтпуска = ПредставлениеОтпуска + ?(ПредставлениеОтпуска = "", "", ", ") + ПредставлениеДополнительныхОтпусков;
		КонецЕсли;
		
		НоваяСтрока.ПредставлениеОтпуска = ПредставлениеОтпуска;
		
	КонецЦикла;
	
	ЗаполнитьУведомленияОНачалеОтпуска();
	
	Если ВыбранныеСотрудники <> Неопределено Тогда 	
		Для Каждого ВыбранныйСотрудник Из ВыбранныеСотрудники Цикл
			Если ДобавленныеСотрудники[ВыбранныйСотрудник] = Неопределено Тогда 
				ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
					НСтр("ru = '%1: отсутствуют запланированные отпуска в указанном периоде.'"), Строка(ВыбранныйСотрудник));
				СообщенияБЗККлиентСервер.СообщитьВФорме(ТекстСообщения, , , УникальныйИдентификатор);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУведомленияОНачалеОтпуска()
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ЗапланированныеОтпуска", ЗапланированныеОтпуска.Выгрузить(, "Организация, Сотрудник, ДатаНачала, ДатаОкончания"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗапланированныеОтпуска.Организация КАК Организация,
		|	ЗапланированныеОтпуска.Сотрудник КАК Сотрудник,
		|	ЗапланированныеОтпуска.ДатаНачала КАК ДатаНачала,
		|	ЗапланированныеОтпуска.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТЗапланированныеОтпуска
		|ИЗ
		|	&ЗапланированныеОтпуска КАК ЗапланированныеОтпуска
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗапланированныеОтпуска.Организация КАК Организация,
		|	ЗапланированныеОтпуска.Сотрудник КАК Сотрудник,
		|	ЗапланированныеОтпуска.ДатаНачала КАК ДатаНачала,
		|	ЗапланированныеОтпуска.ДатаОкончания КАК ДатаОкончания,
		|	УведомлениеОНачалеОтпуска.Ссылка КАК Уведомление,
		|	ДокументыЭДО.Ссылка КАК ДокументЭДО
		|ИЗ
		|	ВТЗапланированныеОтпуска КАК ЗапланированныеОтпуска
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УведомлениеОНачалеОтпуска КАК УведомлениеОНачалеОтпуска
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ДокументЭДОБЗК КАК ДокументыЭДО
		|			ПО УведомлениеОНачалеОтпуска.Ссылка = ДокументыЭДО.ОснованиеДокумента
		|				И (НЕ ДокументыЭДО.ПометкаУдаления)
		|		ПО ЗапланированныеОтпуска.Организация = УведомлениеОНачалеОтпуска.Организация
		|			И ЗапланированныеОтпуска.Сотрудник = УведомлениеОНачалеОтпуска.Сотрудник
		|			И ЗапланированныеОтпуска.ДатаНачала = УведомлениеОНачалеОтпуска.ДатаНачала
		|			И ЗапланированныеОтпуска.ДатаОкончания = УведомлениеОНачалеОтпуска.ДатаОкончания
		|			И (УведомлениеОНачалеОтпуска.Проведен)";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Отбор = Новый Структура("Организация, Сотрудник, ДатаНачала, ДатаОкончания");
		ЗаполнитьЗначенияСвойств(Отбор, Выборка);
		НайденныеСтроки = ЗапланированныеОтпуска.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 0 Тогда 
			НайденныеСтроки[0].Уведомление = Выборка.Уведомление;
			НайденныеСтроки[0].ДокументЭДО = Выборка.ДокументЭДО;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция АдресСпискаПодобранныхСотрудников()
	
	Возврат ПоместитьВоВременноеХранилище(ЗапланированныеОтпуска.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник"), УникальныйИдентификатор);
	
КонецФункции

&НаСервере
Процедура ЗапланированныеОтпускаОбработкаВыбораНаСервере(ВыбранныеСотрудники)
	
	Запрос = Новый Запрос;
	
	Запрос.УстановитьПараметр("ВыбранныеСотрудники", ВыбранныеСотрудники);
	
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Сотрудники.Ссылка КАК Сотрудник,
		|	НЕ ПубликуемыеОбъекты.Ссылка ЕСТЬ NULL КАК Выгружается
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВыгружаемыеОбъектыКабинетСотрудника КАК ПубликуемыеОбъекты
		|		ПО Сотрудники.Ссылка = ПубликуемыеОбъекты.Ссылка
		|			И (НЕ ПубликуемыеОбъекты.УсловноВыгружается)
		|			И (НЕ ПубликуемыеОбъекты.ВыгружаетсяПоСсылке)
		|ГДЕ
		|	Сотрудники.Ссылка В(&ВыбранныеСотрудники)";
	
    Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		Если Не Выборка.Выгружается Тогда 
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1: не настроена выгрузка в 1С:Кабинет сотрудника.'"), Строка(Выборка.Сотрудник));
			СообщенияБЗККлиентСервер.СообщитьВФорме(ТекстСообщения, , , УникальныйИдентификатор);
			ОбщегоНазначенияКлиентСервер.УдалитьЗначениеИзМассива(ВыбранныеСотрудники, Выборка.Сотрудник);
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьЗапланированныеОтпуска(ВыбранныеСотрудники);
	
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	СвязиПараметровВыбора = Новый Массив;
	Если ЗначениеЗаполнено(Организация) Тогда 
		СвязиПараметровВыбора.Добавить(Новый СвязьПараметраВыбора("Отбор.Владелец", "Организация"));
	КонецЕсли;
	
	Элементы.Подразделение.СвязиПараметровВыбора = Новый ФиксированныйМассив(СвязиПараметровВыбора);
	
КонецПроцедуры

&НаСервере
Функция СформироватьУведомленияДлительнаяОперация()
	
	Отбор = Новый Структура("Уведомление", Документы.УведомлениеОНачалеОтпуска.ПустаяСсылка());
	ИсходныеДанные = ЗапланированныеОтпуска.Выгрузить(Отбор);
	
	Если ИсходныеДанные.Количество() = 0 Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьПроцедуру(
			ПараметрыВыполнения,
			"ОстаткиОтпусков.СформироватьУведомленияОНачалеОтпуска",
			ИсходныеДанные);
			
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура СформироватьУведомленияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Ошибка" Тогда
		ТекстСообщения = НСтр("ru = 'При выполнении фонового задания возникла ошибка:'") + Символы.ПС + Результат.КраткоеПредставлениеОшибки;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	ЗаполнитьУведомленияОНачалеОтпуска();
	ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Формирование уведомлений завершено'"));
	
КонецПроцедуры

&НаСервере
Функция СписокУведомленийДляПечати()
	
	СписокУведомлений = Новый Массив;
	Для Каждого ДанныеОтпуска Из ЗапланированныеОтпуска Цикл 
		Если ЗначениеЗаполнено(ДанныеОтпуска.Уведомление) Тогда 
			СписокУведомлений.Добавить(ДанныеОтпуска.Уведомление);
		КонецЕсли;
	КонецЦикла;
	
	Возврат СписокУведомлений;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновленыДанныеДокументовКЭДО" Тогда 
		ЗаполнитьЗапланированныеОтпуска();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
